Documents/ЗаменаСерий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>ЗаменаСерий</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацииЗаменаСерий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНовая</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТовара</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыОперацииЗаменаСерий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>ВидыОперацииЗаменаСерий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаменаСерийОднойНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаменаНоменклатурыВОднойСерии</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаменаСерий/Ext/ObjectModule.bsl
Процедура ПроверитьВозможностьПроведения(Отказ)
	
	Если НЕ ЗначениеЗаполнено(ВидОперации) Тогда
		Сообщить("Не заполнен вид операции");
		Отказ = Истина;
	КонецЕсли;
	Для каждого СтрокаТЧ Из Товары Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Партия) Тогда
			Сообщить("Не заполнена партия в строке " + СтрокаТЧ.НомерСтроки);
			Отказ = Истина;
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Серия) Тогда
			Сообщить("Не заполнена старая серия в строке " + СтрокаТЧ.НомерСтроки);
			Отказ = Истина;
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.СерияНовая) Тогда
			Сообщить("Не заполнена новая серия в строке " + СтрокаТЧ.НомерСтроки);
			Отказ = Истина;
		КонецЕсли;	
	КонецЦикла;	

КонецПроцедуры
  
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроверитьВозможностьПроведения(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацииЗаменаСерий.ЗаменаСерийОднойНоменклатуры Тогда
		
		Запр = Новый Запрос;
		Запр.УстановитьПараметр("Дата", Дата);
		Запр.УстановитьПараметр("Ссылка", Ссылка);
		Запр.Текст = "ВЫБРАТЬ
		             |	Рег.Партия КАК Партия,
		             |	Рег.Партия.Серия КАК Серия,
		             |	ТЧТовары.СерияНовая КАК СерияНовая,
		             |	Рег.ОстатокОстаток КАК Остаток,
		             |	ТЧТовары.Партия.Владелец КАК Номенклатура
		             |ИЗ
		             |	(ВЫБРАТЬ
		             |		Товары.Партия КАК Партия,
		             |		Товары.Серия КАК Серия,
		             |		Товары.СерияНовая КАК СерияНовая
		             |	ИЗ
		             |		Документ.ЗаменаСерий.Товары КАК Товары
		             |	ГДЕ
		             |		Товары.Ссылка = &Ссылка) КАК ТЧТовары
		             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТовара.Остатки(&Дата, ) КАК Рег
		             |		ПО ТЧТовары.Партия = Рег.Партия
		             |			И ТЧТовары.Серия = Рег.Партия.Серия";
		Выборка = Запр.Выполнить().Выбрать();	
		Пока Выборка.Следующий() Цикл
			Если Выборка.Остаток <= 0 Тогда 
				Сообщить("Нет остатков серии " + Выборка.Серия);
			 	Отказ = Истина;
			КонецЕсли;
		КонецЦикла;

		Если НЕ Отказ Тогда
			Выборка.Сбросить();
			Пока Выборка.Следующий() Цикл	
				ПартияОбъект = Выборка.Партия.ПолучитьОбъект();
				ПартияОбъект.Серия = Выборка.СерияНовая;
				гоЗаписьЖурналаРегистрации(СтрШаблон("Замена серии %1: %2 -> %3", Выборка.Номенклатура, Выборка.Серия, Выборка.СерияНовая), , "Проведение", Выборка.Партия, ); 
				ПартияОбъект.Записать(); 
			КонецЦикла;
		КонецЕсли;
		
	Иначе
	
		
	
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если ВидОперации = Перечисления.ВидыОперацииЗаменаСерий.ЗаменаСерийОднойНоменклатуры Тогда       
		
		Запр = Новый Запрос;
		Запр.УстановитьПараметр("Дата", Дата);
		Запр.УстановитьПараметр("Ссылка", Ссылка);
		Запр.Текст = "ВЫБРАТЬ
		             |	Рег.Партия КАК Партия,
		             |	Рег.Партия.Серия КАК Серия,
		             |	ТЧТовары.СерияНовая КАК СерияНовая,
		             |	Рег.ОстатокОстаток КАК Остаток,
		             |	ТЧТовары.Партия.Владелец КАК Номенклатура
		             |ИЗ
		             |	(ВЫБРАТЬ
		             |		Товары.Партия КАК Партия,
		             |		Товары.Серия КАК Серия,
		             |		Товары.СерияНовая КАК СерияНовая
		             |	ИЗ
		             |		Документ.ЗаменаСерий.Товары КАК Товары
		             |	ГДЕ
		             |		Товары.Ссылка = &Ссылка) КАК ТЧТовары
		             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТовара.Остатки(&Дата, ) КАК Рег
		             |		ПО ТЧТовары.Партия = Рег.Партия
		             |			И ТЧТовары.СерияНовая = Рег.Партия.Серия";
		Выборка = Запр.Выполнить().Выбрать();	
		Пока Выборка.Следующий() Цикл
			Если Выборка.Остаток <= 0 Тогда 
				Сообщить("Нет остатков серии " + Выборка.СерияНовая);
			 	Отказ = Истина;
			КонецЕсли;
		КонецЦикла;

		Если НЕ Отказ Тогда
			Выборка.Сбросить();
			Пока Выборка.Следующий() Цикл	
				ПартияОбъект = Выборка.Партия.ПолучитьОбъект();
				ПартияОбъект.Серия = Выборка.Серия;
				гоЗаписьЖурналаРегистрации(СтрШаблон("Замена серии %1: %2 -> %3", Выборка.Номенклатура, Выборка.Серия, Выборка.СерияНовая), , "Отмена проведения", Выборка.Партия, ); 
				ПартияОбъект.Записать(); 
			КонецЦикла;
		КонецЕсли;
		
	Иначе
	
		
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(КемСоздан) Тогда КемСоздан = гоПользователь() КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(Создан) Тогда Создан = ТекущаяДата() КонецЕсли; 
	КемСохранен = гоПользователь();
	Сохранен = ТекущаяДата();

КонецПроцедуры
